s1 = list(map(int,input().split()))
s2 = list(map(int,input().split()))

ans = s2[0]

for i in range(s1[0]):
  # print(s2[i]+s1[1], s2[i+1])
  if ans >= s2[i]:
    ans += s1[1]
  else:
    ans = s2[i] + s1[1]
  print(ans)

  """
10 50000
120190 165111 196897 456895 540000 552614 561627 743796 757613 991216

170190
220190
270190
506895
590000
640000
690000
793796
843796
1041216


  """
    

# 5 50 
# 100 120 150 260 270

# 100に50をプラス
# 150と120 120の方が小さい
# そのまま150に50プラス
# 170と150 150の方が小さい
# そのまま200に50プラス
# 200と260 260の方が大きい
# 260に50プラス
